grevaillot/svd_tools/headers/STM32G474xx/fdcan3.h
/** @defgroup fdcan3_crel CREL FDCAN Core Release Register
@{*/


#define FDCAN3_CREL_REL_SHIFT		28
#define FDCAN3_CREL_REL_MASK		0x0f
/** @defgroup fdcan3_crel_rel REL REL
@{*/
/**@}*/


#define FDCAN3_CREL_STEP_SHIFT		24
#define FDCAN3_CREL_STEP_MASK		0x0f
/** @defgroup fdcan3_crel_step STEP STEP
@{*/
/**@}*/


#define FDCAN3_CREL_SUBSTEP_SHIFT		20
#define FDCAN3_CREL_SUBSTEP_MASK		0x0f
/** @defgroup fdcan3_crel_substep SUBSTEP SUBSTEP
@{*/
/**@}*/


#define FDCAN3_CREL_YEAR_SHIFT		16
#define FDCAN3_CREL_YEAR_MASK		0x0f
/** @defgroup fdcan3_crel_year YEAR YEAR
@{*/
/**@}*/


#define FDCAN3_CREL_MON_SHIFT		8
#define FDCAN3_CREL_MON_MASK		0xff
/** @defgroup fdcan3_crel_mon MON MON
@{*/
/**@}*/


#define FDCAN3_CREL_DAY_SHIFT		0
#define FDCAN3_CREL_DAY_MASK		0xff
/** @defgroup fdcan3_crel_day DAY DAY
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan3_endn ENDN FDCAN Core Release Register
@{*/


#define FDCAN3_ENDN_ETV_SHIFT		0
#define FDCAN3_ENDN_ETV_MASK		0xffffffff
/** @defgroup fdcan3_endn_etv ETV ETV
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan3_dbtp DBTP This register is only writable if bits CCCR.CCE and CCCR.INIT are set. The CAN bit time may be programed in the range of 4 to 25 time quanta. The CAN time quantum may be programmed in the range of 1 to 1024 FDCAN clock periods. tq = (DBRP + 1) FDCAN clock period. DTSEG1 is the sum of Prop_Seg and Phase_Seg1. DTSEG2 is Phase_Seg2. Therefore the length of the bit time is (programmed values) [DTSEG1 + DTSEG2 + 3] tq or (functional values) [Sync_Seg + Prop_Seg + Phase_Seg1 + Phase_Seg2] tq. The Information Processing Time (IPT) is zero, meaning the data for the next bit is available at the first clock edge after the sample point.
@{*/

/** FDCAN3_DBTP_TDC TDC **/
#define FDCAN3_DBTP_TDC		(1 << 23)

#define FDCAN3_DBTP_DBRP_SHIFT		16
#define FDCAN3_DBTP_DBRP_MASK		0x1f
/** @defgroup fdcan3_dbtp_dbrp DBRP DBRP
@{*/
/**@}*/


#define FDCAN3_DBTP_DTSEG1_SHIFT		8
#define FDCAN3_DBTP_DTSEG1_MASK		0x1f
/** @defgroup fdcan3_dbtp_dtseg1 DTSEG1 DTSEG1
@{*/
/**@}*/


#define FDCAN3_DBTP_DTSEG2_SHIFT		4
#define FDCAN3_DBTP_DTSEG2_MASK		0x0f
/** @defgroup fdcan3_dbtp_dtseg2 DTSEG2 DTSEG2
@{*/
/**@}*/


#define FDCAN3_DBTP_DSJW_SHIFT		0
#define FDCAN3_DBTP_DSJW_MASK		0x0f
/** @defgroup fdcan3_dbtp_dsjw DSJW DSJW
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan3_test TEST Write access to the Test Register has to be enabled by setting bit CCCR[TEST] to 1 . All Test Register functions are set to their reset values when bit CCCR[TEST] is reset. Loop Back mode and software control of Tx pin FDCANx_TX are hardware test modes. Programming TX differently from 00 may disturb the message transfer on the CAN bus.
@{*/

/** FDCAN3_TEST_RX RX **/
#define FDCAN3_TEST_RX		(1 << 7)

#define FDCAN3_TEST_TX_SHIFT		5
#define FDCAN3_TEST_TX_MASK		0x03
/** @defgroup fdcan3_test_tx TX TX
@{*/
/**@}*/

/** FDCAN3_TEST_LBCK LBCK **/
#define FDCAN3_TEST_LBCK		(1 << 4)

/**@}*/

/** @defgroup fdcan3_rwd RWD The RAM Watchdog monitors the READY output of the Message RAM. A Message RAM access starts the Message RAM Watchdog Counter with the value configured by the RWD[WDC] bits. The counter is reloaded with RWD[WDC] bits when the Message RAM signals successful completion by activating its READY output. In case there is no response from the Message RAM until the counter has counted down to 0, the counter stops and interrupt flag IR[WDI] bit is set. The RAM Watchdog Counter is clocked by the fdcan_pclk clock.
@{*/


#define FDCAN3_RWD_WDV_SHIFT		8
#define FDCAN3_RWD_WDV_MASK		0xff
/** @defgroup fdcan3_rwd_wdv WDV WDV
@{*/
/**@}*/


#define FDCAN3_RWD_WDC_SHIFT		0
#define FDCAN3_RWD_WDC_MASK		0xff
/** @defgroup fdcan3_rwd_wdc WDC WDC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan3_cccr CCCR For details about setting and resetting of single bits see Software initialization.
@{*/

/** FDCAN3_CCCR_NISO NISO **/
#define FDCAN3_CCCR_NISO		(1 << 15)
/** FDCAN3_CCCR_TXP TXP **/
#define FDCAN3_CCCR_TXP		(1 << 14)
/** FDCAN3_CCCR_EFBI EFBI **/
#define FDCAN3_CCCR_EFBI		(1 << 13)
/** FDCAN3_CCCR_PXHD PXHD **/
#define FDCAN3_CCCR_PXHD		(1 << 12)
/** FDCAN3_CCCR_BRSE BRSE **/
#define FDCAN3_CCCR_BRSE		(1 << 9)
/** FDCAN3_CCCR_FDOE FDOE **/
#define FDCAN3_CCCR_FDOE		(1 << 8)
/** FDCAN3_CCCR_TEST TEST **/
#define FDCAN3_CCCR_TEST		(1 << 7)
/** FDCAN3_CCCR_DAR DAR **/
#define FDCAN3_CCCR_DAR		(1 << 6)
/** FDCAN3_CCCR_MON MON **/
#define FDCAN3_CCCR_MON		(1 << 5)
/** FDCAN3_CCCR_CSR CSR **/
#define FDCAN3_CCCR_CSR		(1 << 4)
/** FDCAN3_CCCR_CSA CSA **/
#define FDCAN3_CCCR_CSA		(1 << 3)
/** FDCAN3_CCCR_ASM ASM **/
#define FDCAN3_CCCR_ASM		(1 << 2)
/** FDCAN3_CCCR_CCE CCE **/
#define FDCAN3_CCCR_CCE		(1 << 1)
/** FDCAN3_CCCR_INIT INIT **/
#define FDCAN3_CCCR_INIT		(1 << 0)

/**@}*/

/** @defgroup fdcan3_nbtp NBTP FDCAN_NBTP
@{*/


#define FDCAN3_NBTP_NSJW_SHIFT		25
#define FDCAN3_NBTP_NSJW_MASK		0x7f
/** @defgroup fdcan3_nbtp_nsjw NSJW NSJW
@{*/
/**@}*/


#define FDCAN3_NBTP_NBRP_SHIFT		16
#define FDCAN3_NBTP_NBRP_MASK		0x1ff
/** @defgroup fdcan3_nbtp_nbrp NBRP NBRP
@{*/
/**@}*/


#define FDCAN3_NBTP_NTSEG1_SHIFT		8
#define FDCAN3_NBTP_NTSEG1_MASK		0xff
/** @defgroup fdcan3_nbtp_ntseg1 NTSEG1 NTSEG1
@{*/
/**@}*/


#define FDCAN3_NBTP_TSEG2_SHIFT		0
#define FDCAN3_NBTP_TSEG2_MASK		0x7f
/** @defgroup fdcan3_nbtp_tseg2 TSEG2 TSEG2
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan3_tscc TSCC FDCAN Timestamp Counter Configuration Register
@{*/


#define FDCAN3_TSCC_TCP_SHIFT		16
#define FDCAN3_TSCC_TCP_MASK		0x0f
/** @defgroup fdcan3_tscc_tcp TCP TCP
@{*/
/**@}*/


#define FDCAN3_TSCC_TSS_SHIFT		0
#define FDCAN3_TSCC_TSS_MASK		0x03
/** @defgroup fdcan3_tscc_tss TSS TSS
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan3_tscv TSCV FDCAN Timestamp Counter Value Register
@{*/


#define FDCAN3_TSCV_TSC_SHIFT		0
#define FDCAN3_TSCV_TSC_MASK		0xffff
/** @defgroup fdcan3_tscv_tsc TSC TSC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan3_tocc TOCC FDCAN Timeout Counter Configuration Register
@{*/


#define FDCAN3_TOCC_TOP_SHIFT		16
#define FDCAN3_TOCC_TOP_MASK		0xffff
/** @defgroup fdcan3_tocc_top TOP TOP
@{*/
/**@}*/


#define FDCAN3_TOCC_TOS_SHIFT		1
#define FDCAN3_TOCC_TOS_MASK		0x03
/** @defgroup fdcan3_tocc_tos TOS TOS
@{*/
/**@}*/

/** FDCAN3_TOCC_ETOC ETOC **/
#define FDCAN3_TOCC_ETOC		(1 << 0)

/**@}*/

/** @defgroup fdcan3_tocv TOCV FDCAN Timeout Counter Value Register
@{*/


#define FDCAN3_TOCV_TOC_SHIFT		0
#define FDCAN3_TOCV_TOC_MASK		0xffff
/** @defgroup fdcan3_tocv_toc TOC TOC
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan3_ecr ECR FDCAN Error Counter Register
@{*/


#define FDCAN3_ECR_CEL_SHIFT		16
#define FDCAN3_ECR_CEL_MASK		0xff
/** @defgroup fdcan3_ecr_cel CEL CEL
@{*/
/**@}*/

/** FDCAN3_ECR_RP RP **/
#define FDCAN3_ECR_RP		(1 << 15)

#define FDCAN3_ECR_TREC_SHIFT		8
#define FDCAN3_ECR_TREC_MASK		0x7f
/** @defgroup fdcan3_ecr_trec TREC TREC
@{*/
/**@}*/


#define FDCAN3_ECR_TEC_SHIFT		0
#define FDCAN3_ECR_TEC_MASK		0xff
/** @defgroup fdcan3_ecr_tec TEC TEC
@{*/
/**@}*/


/**@}*/

